
/*
*********************************************************************************************************
*	                                  
*	模块名称 : EEPROM读写演示模块。
*	文件名称 : eeDemo.c
*	版    本 : V1.0
*	说    明 : EERPOM （24xx02）读写例程。安富莱开发板标配的EEPROM型号为 AT24C02  (256字节)
*	修改记录 :
*		版本号  日期       作者    说明
*		v1.0    2011-05-13 armfly  ST固件库V3.5.0版本。
*
*	Copyright (C), 2010-2011, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include "stm32f10x.h"
#include <stdio.h>
#include "bsp_24xx02.h"
#include "Ta_calibration.h"	//获得当前时间以及校准时间
#include "ta_eeprom.h"




uint8_t buff_ReadFromEEPROM[DATA_LEN+1];
extern gpsSeconds; 	//GPS时间秒数总和
extern totalSeconds;// 当前时间秒数总和

int sucess=1;//读取EEPROM是否成功
/*
*********************************************************************************************************
*	函 数 名: ee_ReadTest
*	功能说明: 读串行EEPROM全部数据
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void  ee_Read(void)
{
    int a=0,b=0,i=0;
	/* 读EEPROM, 起始地址 = 0， 数据长度为 256 */
	if (ee_ReadBytes((uint8_t *)buff_ReadFromEEPROM, 0, DATA_LEN) == 0)		 
	  //读取失败	
	  sucess=0;
	else{
	  //读取成功
	  sucess=1;
	}
}

/*
*********************************************************************************************************
*	函 数 名: ee_ReadTest
*	功能说明: 写串行EEPROM全部数据
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void ee_Write(int seconds)
{

	int i=0;
	int k=1;
	int m=seconds;
 	for(i=0;i<8;i++){
		buff_ReadFromEEPROM[i]=m%10;
		m=m/10;
	}
	/* 写EEPROM, 起始地址 = 0，数据长度为 256 */
	 if(ee_WriteBytes(buff_ReadFromEEPROM, 0, DATA_LEN) == 0){
	   //表示写入错误
	 }
}

/*
*********************************************************************************************************
*	函 数 名: ee_ReadTest
*	功能说明: 读串行EEPROM全部数据，并打印出来
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void ee_Erase(void)
{
	uint16_t i;
	uint8_t buf[DATA_LEN];
	
	/* 填充缓冲区 */
	for (i = 0; i < DATA_LEN; i++)
	{
		buf[i] = 0xFF;
	}
	
	/* 写EEPROM, 起始地址 = 0，数据长度为 256 */
	if (ee_WriteBytes(buf, 0, DATA_LEN) == 0)
	{
		return;
	}
	else
	{
		//printf("擦除eeprom成功！\r\n");
		return;
	}
}

